In [1]:
import pandas as pd
df = pd.read_csv('gapminder.tsv', sep='\t')

FileNotFoundError: [Errno 2] No such file or directory: 'gapminder.tsv'

In [3]:
df.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [5]:
df.shape
df.shape[0]

1704

In [6]:
df.columns

Index(['country', 'continent', 'year', 'lifeExp', 'pop', 'gdpPercap'], dtype='object')

In [7]:
df.dtypes
#object:문자열

country       object
continent     object
year           int64
lifeExp      float64
pop            int64
gdpPercap    float64
dtype: object

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   country    1704 non-null   object
 1   continent  1704 non-null   object
 2   year       1704 non-null   int64
 3   lifeExp    1704 non-null   float64
 4   pop        1704 non-null   int64
 5   gdpPercap  1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

In [10]:
cdf=df['country']
type(cdf)

pandas.core.series.Series

In [13]:
cdf.head()
cdf.tail(10)

1694    Zimbabwe
1695    Zimbabwe
1696    Zimbabwe
1697    Zimbabwe
1698    Zimbabwe
1699    Zimbabwe
1700    Zimbabwe
1701    Zimbabwe
1702    Zimbabwe
1703    Zimbabwe
Name: country, dtype: object

In [14]:
df.columns

Index(['country', 'continent', 'year', 'lifeExp', 'pop', 'gdpPercap'], dtype='object')

In [15]:
subset=df[['country', 'continent', 'year']]

In [16]:
subset

          country continent  year
0     Afghanistan      Asia  1952
1     Afghanistan      Asia  1957
2     Afghanistan      Asia  1962
3     Afghanistan      Asia  1967
4     Afghanistan      Asia  1972
...           ...       ...   ...
1699     Zimbabwe    Africa  1987
1700     Zimbabwe    Africa  1992
1701     Zimbabwe    Africa  1997
1702     Zimbabwe    Africa  2002
1703     Zimbabwe    Africa  2007

[1704 rows x 3 columns]

In [ ]:
"""
loc:라벨 색인(index)을 가지고 데이터를 추출
iloc:정수 색인(index)를 가지고 데이터를 추출
"""

In [21]:
import pandas as pd
import numpy as np

In [22]:
#loc:라벨 색인(index)을 가지고 데이터를 추출
# 데이터프레임.loc[행 인덱스]
# 데이터프레임.loc[행 인덱스, 열 인덱스]

In [23]:
df = pd.DataFrame(np.arange(10, 22).reshape(3, 4),
                  index=["a", "b", "c"],
                  columns=["A", "B", "C", "D"])
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [24]:
df.loc['a'] #a 행 인덱스가 시리즈 형태로 추출

A    10
B    11
C    12
D    13
Name: a, dtype: int32

In [25]:
df['a':'b']
df.loc['a':'b']

    A   B   C   D
a  10  11  12  13
b  14  15  16  17

In [26]:
df.loc[['a','c']] #서로 떨어진 행을 추출
#df[['a','c']] #에러 발생

    A   B   C   D
a  10  11  12  13
c  18  19  20  21

In [27]:
df.A
df['A']

a    10
b    14
c    18
Name: A, dtype: int32

In [28]:
df.A>15

a    False
b    False
c     True
Name: A, dtype: bool

In [29]:
df[df.A>15]

    A   B   C   D
c  18  19  20  21

In [30]:
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [31]:
df.loc[df.A>15]

    A   B   C   D
c  18  19  20  21

In [32]:
def select_rows(df):
    return df.A>15

In [33]:
select_rows(df)

a    False
b    False
c     True
Name: A, dtype: bool

In [34]:
df.loc[select_rows(df)]

    A   B   C   D
c  18  19  20  21

In [35]:
df2 = pd.DataFrame(np.arange(10, 26).reshape(4, 4), columns=["A", "B", "C", "D"])

In [36]:
df2

    A   B   C   D
0  10  11  12  13
1  14  15  16  17
2  18  19  20  21
3  22  23  24  25

In [53]:
df2.loc[1:2]
#df2.loc['A'] 에러, 열을 추출할때는 loc를 빼고 써야 함
#df2['A']
#df2.A

    A   B   C   D
1  14  15  16  17
2  18  19  20  21

In [54]:
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [55]:
df.loc['a']

A    10
B    11
C    12
D    13
Name: a, dtype: int32

In [56]:
df.loc['a'].loc['A']#행 인덱스 a인 자료 추출(시리즈)->행 인덱스가 A인 자료 추출

10

In [59]:
df.loc['a', 'A'] #행 인덱스 a, 열 인덱스 A인 위치의 값을 추출

10

In [60]:
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [64]:
df.loc['a':, 'A']

a    10
b    14
c    18
Name: A, dtype: int32

In [66]:
df.loc['a']
df.loc['a',:]

A    10
B    11
C    12
D    13
Name: a, dtype: int32

In [67]:
#퀴즈1
df
#11 13
#15 17

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [77]:
df.loc['a':'b', ['B','D']]
df.loc[:'b', ['B','D']]
df.loc[['a','b'], ['B','D']]

    B   D
a  11  13
b  15  17

In [78]:
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [81]:
df.loc[df.A>10]
df.loc[df.A>10, ['C','D']]

    C   D
b  16  17
c  20  21

In [82]:
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [103]:
df.iloc[0,-2:]
df.iloc[-1]=df.iloc[-1]*2
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  36  38  40  42

In [99]:
#퀴즈2(iloc 추출)
# 1) 12 13
# 2) 19 20
# 3) 18 19 20 21
print(df.iloc[0,2:])
print(df.iloc[-1, 1:3])
#print(df2.iloc[2,:])

C    12
D    13
Name: a, dtype: int32
B    19
C    20
Name: c, dtype: int32

In [92]:
df.iloc[0:2,2]

a    12
b    16
Name: C, dtype: int32

In [87]:
df.loc['a','B']
df.iloc[0] #기본적으로 숫자 인덱스가 0번부터 부여되어 있다고 가정
df.iloc[:2] #0번~1번 행인덱스에(불포함) 해당되는 데이터가 추출
df.loc[:'c'] #a행 인덱스~c행(포함) 인덱스에 해당되는 데이터가 추출

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [104]:
df = pd.read_csv('gapminder.tsv', sep='\t')

In [105]:
df.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [114]:
df.loc[0] #0은 라벨(눈에 보이는 숫자 0)
df.iloc[0] #0은 숫자 인덱스(눈에 보이지 않는 고유의 숫자 일련번호 0)
df.loc[99]
#df.info()
df.loc[1703]
df.iloc[1703]
df.iloc[-1] #뒤에서 부터 1번째 데이터 추출
#df.loc[-1] #-1이라는 라벨에 해당된느 자료를 추출 (에러)

KeyError: -1

In [119]:
df.shape[0]-1
df.loc[df.shape[0]-1]
df.loc[[0,99,999]]

         country continent  year  lifeExp       pop    gdpPercap
0    Afghanistan      Asia  1952   28.801   8425333   779.445314
99    Bangladesh      Asia  1967   43.453  62821884   721.186086
999     Mongolia      Asia  1967   51.253   1149500  1226.041130

In [123]:
df.loc[df.shape[0]-1]
type(df.loc[df.shape[0]-1])

pandas.core.series.Series

In [125]:
df.iloc[df.shape[0]-1]
#type(df.loc[df.shape[0]-1]) #시리즈

country      Zimbabwe
continent      Africa
year             2007
lifeExp        43.487
pop          12311143
gdpPercap     469.709
Name: 1703, dtype: object

In [127]:
df.tail(1) #데이터프레임

       country continent  year  lifeExp       pop   gdpPercap
1703  Zimbabwe    Africa  2007   43.487  12311143  469.709298

In [134]:
df
subset=df.loc[:,['year','pop']]
subset

# df
# df.iloc[:,[2,4,-1]]

      year       pop   gdpPercap
0     1952   8425333  779.445314
1     1957   9240934  820.853030
2     1962  10267083  853.100710
3     1967  11537966  836.197138
4     1972  13079460  739.981106
...    ...       ...         ...
1699  1987   9216418  706.157306
1700  1992  10704340  693.420786
1701  1997  11404948  792.449960
1702  2002  11926563  672.038623
1703  2007  12311143  469.709298

[1704 rows x 3 columns]

In [136]:
list(range(5))

[0, 1, 2, 3, 4]

In [139]:
df.iloc[:,list(range(5))]
df.iloc[:,list(range(3,6))]
df.iloc[:,list(range(0,6,2))]

          country  year       pop
0     Afghanistan  1952   8425333
1     Afghanistan  1957   9240934
2     Afghanistan  1962  10267083
3     Afghanistan  1967  11537966
4     Afghanistan  1972  13079460
...           ...   ...       ...
1699     Zimbabwe  1987   9216418
1700     Zimbabwe  1992  10704340
1701     Zimbabwe  1997  11404948
1702     Zimbabwe  2002  11926563
1703     Zimbabwe  2007  12311143

[1704 rows x 3 columns]

In [141]:
df.iloc[:, :3]
df.iloc[:, 0:6:2]

          country  year       pop
0     Afghanistan  1952   8425333
1     Afghanistan  1957   9240934
2     Afghanistan  1962  10267083
3     Afghanistan  1967  11537966
4     Afghanistan  1972  13079460
...           ...   ...       ...
1699     Zimbabwe  1987   9216418
1700     Zimbabwe  1992  10704340
1701     Zimbabwe  1997  11404948
1702     Zimbabwe  2002  11926563
1703     Zimbabwe  2007  12311143

[1704 rows x 3 columns]

In [142]:
#          country  lifeExp    gdpPercap
# 0    Afghanistan   28.801   779.445314
# 99    Bangladesh   43.453   721.186086
# 999     Mongolia   51.253  1226.041130

In [148]:
# iloc
#df.iloc[[0,99,999],[0,3,5]]
# loc
df.loc[[0,99,999],['country',  'lifeExp',    'gdpPercap']]

         country  lifeExp    gdpPercap
0    Afghanistan   28.801   779.445314
99    Bangladesh   43.453   721.186086
999     Mongolia   51.253  1226.041130

In [152]:
s=pd.Series(range(10))
s
s[3]=np.nan
s

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [154]:
s.count() #데이터 개수를 세는 함수, 누락값은 제외

9

In [155]:
np.random.seed(2)
df = pd.DataFrame(np.random.randint(5, size=(4, 4)), dtype=float)

In [159]:
df
df.iloc[2, 3]=np.nan

In [160]:
df

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [162]:
#df.info()
df.count()

0    4
1    4
2    4
3    3
dtype: int64

In [37]:
import seaborn as sns

In [38]:
t=sns.load_dataset("titanic")
t.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [166]:
t.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [167]:
np.random.seed(1)
s2 = pd.Series(np.random.randint(6, size=100))

In [169]:
s2
#시리즈에 저장된 값이 정수, 문자, 카테고리 값인 경우에는 value_counts함수
#사용할 수 있음

0     5
1     3
2     4
3     0
4     1
     ..
95    4
96    5
97    2
98    4
99    3
Length: 100, dtype: int32

In [170]:
s2.value_counts()

1    22
0    18
4    17
5    16
3    14
2    13
dtype: int64

In [171]:
df

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [174]:
#df.value_counts() 적용할 수 없음
df[0]
df[0].value_counts()

3.0    2
4.0    1
0.0    1
Name: 0, dtype: int64

In [177]:
s2

0     5
1     3
2     4
3     0
4     1
     ..
95    4
96    5
97    2
98    4
99    3
Length: 100, dtype: int32

In [176]:
s2.value_counts()

1    22
0    18
4    17
5    16
3    14
2    13
dtype: int64

In [178]:
s2.value_counts().sort_index()

0    18
1    22
2    13
3    14
4    17
5    16
dtype: int64

In [181]:
s2.sort_values() #값을 기준으로 오름차순
s2.sort_values(ascending=False)

0     5
11    5
46    5
40    5
71    5
     ..
28    0
85    0
39    0
38    0
57    0
Length: 100, dtype: int32

In [182]:
df

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [190]:
#df.sort_values() #에러 발생
#df.sort_values(by=0)
df.sort_values(by=3)

     0    1    2    3
1  3.0  0.0  2.0  1.0
0  0.0  0.0  3.0  2.0
3  4.0  3.0  4.0  2.0
2  3.0  2.0  4.0  NaN

In [191]:
df.sort_values(by=[3,1])

     0    1    2    3
1  3.0  0.0  2.0  1.0
0  0.0  0.0  3.0  2.0
3  4.0  3.0  4.0  2.0
2  3.0  2.0  4.0  NaN

In [194]:
np.random.seed(1)
df2 = pd.DataFrame(np.random.randint(10, size=(4, 8)))
df2

   0  1  2  3  4  5  6  7
0  5  8  9  5  0  0  1  7
1  6  9  2  4  5  2  4  2
2  4  7  7  9  1  7  0  6
3  9  9  7  6  9  1  0  1

In [199]:
df2.sum()
df2.sum(axis=0) #0=행 방향으로 이동해 가면서 계산
df2.sum(axis=1) #1=열 방향으로 이동해 가면서 계산

0    35
1    34
2    41
3    42
dtype: int64

In [201]:
df2['RowSum'] =df2.sum(axis=1)
df2

   0  1  2  3  4  5  6  7  RowSum
0  5  8  9  5  0  0  1  7      35
1  6  9  2  4  5  2  4  2      34
2  4  7  7  9  1  7  0  6      41
3  9  9  7  6  9  1  0  1      42

In [203]:
df2.sum(axis=0)
# df2['ColSum'] =df2.sum(axis=0) 열이 추가되므로, 잘못된 결과 발생

In [205]:
del df2['ColSum']

In [208]:
df2
df2.sum(axis=0)
df2.loc['ColSum']=df2.sum(axis=0)

In [209]:
df2

         0   1   2   3   4   5  6   7  RowSum
0        5   8   9   5   0   0  1   7      35
1        6   9   2   4   5   2  4   2      34
2        4   7   7   9   1   7  0   6      41
3        9   9   7   6   9   1  0   1      42
ColSum  24  33  25  24  15  10  5  16     152

In [210]:
df3 = pd.DataFrame({
    'A': [1, 3, 4, 3, 4],
    'B': [2, 3, 1, 2, 3],
    'C': [1, 5, 2, 4, 4]
})

In [211]:
df3

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [215]:
# df3['A'].min()
# df3['A'].max()
# df3['A'].max()-df3['A'].min()
# ...
# df3['C']...

3

In [218]:
# df3에게 '함수'를 각각의 열 단위로 적용(apply)해라(axis=0)
# df3.apply(함수)

#x에는 df3에 있는 각각의 열이 전달됨
df3.apply(lambda x: x.max()-x.min())
df3.apply(lambda x: x.max()-x.min(), axis=0)

A    3
B    2
C    4
dtype: int64

In [220]:
df3.apply(lambda x: x.max()-x.min(), axis=1) #행 단위로 적용

0    1
1    2
2    3
3    2
4    1
dtype: int64

In [224]:
# df3에 저장된 각각의 값들에 대해 개수를 세는 함수 구현
# ex) A열에는 1이 1개, 2가 0개, 3이 2개, 4가 2개, 5가 0개

df3['A'].value_counts()

4    2
3    2
1    1
Name: A, dtype: int64

In [225]:
df3['B'].value_counts()

3    2
2    2
1    1
Name: B, dtype: int64

In [226]:
df3['C'].value_counts()

4    2
5    1
2    1
1    1
Name: C, dtype: int64

In [227]:
df3.apply(pd.value_counts) #각 열에 대해 value_counts함수 적용됨

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [236]:
#퀴즈3.
# 타이타닉에서 age열 값이 20이상이면 'adult', 미만이면 'child'값을
# 새로운 열('adult_child')에 저장하고 출력하시오

#np.where(조건식, 참, 거짓)
# t['adult_child']=np.where(t['age']>=20, 'adult', 'child')
# t

#['adult' if 나이>=20 else 'child' for 나이 in t.age]
# t['adult_child']=['adult' if pa>=20 else 'child' for pa in t.age]

In [238]:
t['adult_child2']=t.apply(lambda x: 'adult' if x.age>=20 else 'child', axis=1)

In [239]:
t

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult_child,adult_child2
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,adult,adult
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,adult,adult
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,adult,adult
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,adult,adult
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,adult,adult
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,adult,adult
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,child,child
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,child,child
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,adult,adult
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,adult,adult

In [242]:
#fillna
df3.apply(pd.value_counts).fillna(0)

     A    B    C
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [246]:
df3.apply(pd.value_counts).fillna(0).astype(int)

   A  B  C
1  1  1  1
2  0  2  1
3  2  2  0
4  2  0  2
5  0  0  1

In [247]:
type(df3.apply(pd.value_counts).fillna(0))

pandas.core.frame.DataFrame

In [248]:
#cut:경계를 지정해서 나눔
#qcut:똑같은 개수의 구간으로 나눔

In [254]:
ages = [0, 2, 10, 21, 23, 37, 31, 61, 20, 41, 32, 101]
bins=[1, 20, 30, 50, 70, 100] #5개의 구간으로 나누겠다

In [255]:
pd.cut(ages, bins)

[NaN, (1.0, 20.0], (1.0, 20.0], (20.0, 30.0], (20.0, 30.0], ..., (50.0, 70.0], (1.0, 20.0], (30.0, 50.0], (30.0, 50.0], NaN]
Length: 12
Categories (5, interval[int64]): [(1, 20] < (20, 30] < (30, 50] < (50, 70] < (70, 100]]

In [258]:
lb=["미성년", "청년", "중년", "장년","노년"]

In [259]:
pd.cut(ages, bins, labels=lb)

[NaN, '미성년', '미성년', '청년', '청년', ..., '장년', '미성년', '중년', '중년', NaN]
Length: 12
Categories (5, object): ['미성년' < '청년' < '중년' < '장년' < '노년']

In [260]:
mycuts=pd.cut(ages, bins, labels=lb)

In [261]:
mycuts.categories

Index(['미성년', '청년', '중년', '장년', '노년'], dtype='object')

In [262]:
mycuts.codes

array([-1,  0,  0,  1,  1,  2,  2,  3,  0,  2,  2, -1], dtype=int8)

In [263]:
ages

[0, 2, 10, 21, 23, 37, 31, 61, 20, 41, 32, 101]

In [267]:
df4=pd.DataFrame(ages, columns=['ages'])
df4

    ages
0      0
1      2
2     10
3     21
4     23
5     37
6     31
7     61
8     20
9     41
10    32
11   101

In [271]:
df4['age_cut']=pd.cut(df4.ages, bins, labels=lb)
df4

    ages age_cut
0      0     NaN
1      2     미성년
2     10     미성년
3     21      청년
4     23      청년
5     37      중년
6     31      중년
7     61      장년
8     20     미성년
9     41      중년
10    32      중년
11   101     NaN

In [272]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   ages     12 non-null     int64
 1   age_cut  10 non-null     category
dtypes: category(1), int64(1)
memory usage: 436.0 bytes

In [274]:
# df4['agc_ages']=df4['age_cut']+df4['ages']
# df4
#에러 발생


df4['agc_ages']=df4['age_cut'].astype(str) +df4['ages'].astype(str)
df4

    ages age_cut agc_ages
0      0     NaN     nan0
1      2     미성년     미성년2
2     10     미성년    미성년10
3     21      청년     청년21
4     23      청년     청년23
5     37      중년     중년37
6     31      중년     중년31
7     61      장년     장년61
8     20     미성년    미성년20
9     41      중년     중년41
10    32      중년     중년32
11   101     NaN   nan101

In [275]:
data=np.random.randn(20)

In [276]:
data

array([-0.17242821, -0.87785842,  0.04221375,  0.58281521, -1.10061918,
        1.14472371,  0.90159072,  0.50249434,  0.90085595, -0.68372786,
       -0.12289023, -0.93576943, -0.26788808,  0.53035547, -0.69166075,
       -0.39675353, -0.6871727 , -0.84520564, -0.67124613, -0.0126646 ])

In [277]:
mycuts2=pd.qcut(data, 4, labels=['q1','q2','q3','q4'])
mycuts2

['q3', 'q1', 'q3', 'q4', 'q1', ..., 'q2', 'q2', 'q1', 'q2', 'q3']
Length: 20
Categories (4, object): ['q1' < 'q2' < 'q3' < 'q4']

In [279]:
pd.value_counts(mycuts2)

q4    5
q3    5
q2    5
q1    5
dtype: int64

In [281]:
#set_index, reset_index함수 : 행/열 인덱스 교환

In [284]:
list('ABCDE')

['A', 'B', 'C', 'D', 'E']

In [285]:
np.round(np.random.rand(3, 5), 2)

array([[0.09, 0.02, 0.83, 0.78, 0.87],
       [0.98, 0.8 , 0.46, 0.78, 0.12],
       [0.64, 0.14, 0.94, 0.52, 0.41]])

In [290]:
pd.DataFrame(np.vstack([list('ABCDE'), np.round(np.random.rand(3, 5), 2)]).T,
            columns=["C1", "C2", "C3", "C4"])

  C1    C2    C3    C4
0  A  0.32  0.18  0.68
1  B  0.67  0.59  0.27
2  C  0.13  0.02  0.74
3  D  0.72  0.83  0.96
4  E  0.29   0.0  0.25

In [282]:
np.random.seed(0)
df1 = pd.DataFrame(np.vstack([list('ABCDE'),
                              np.round(np.random.rand(3, 5), 2)]).T,
                   columns=["C1", "C2", "C3", "C4"])

In [283]:
df1

  C1    C2    C3    C4
0  A  0.55  0.65  0.79
1  B  0.72  0.44  0.53
2  C   0.6  0.89  0.57
3  D  0.54  0.96  0.93
4  E  0.42  0.38  0.07

In [ ]:
#set_index:특정 열을 인덱스로 설정 -> 기존의 인덱스는 제거됨

In [291]:
df2=df1.set_index('C1')
df2

      C2    C3    C4
C1
A   0.55  0.65  0.79
B   0.72  0.44  0.53
C    0.6  0.89  0.57
D   0.54  0.96  0.93
E   0.42  0.38  0.07

In [292]:
df2.set_index('C2')

        C3    C4
C2
0.55  0.65  0.79
0.72  0.44  0.53
0.6   0.89  0.57
0.54  0.96  0.93
0.42  0.38  0.07

In [293]:
df2

      C2    C3    C4
C1
A   0.55  0.65  0.79
B   0.72  0.44  0.53
C    0.6  0.89  0.57
D   0.54  0.96  0.93
E   0.42  0.38  0.07

In [294]:
df2.reset_index()

  C1    C2    C3    C4
0  A  0.55  0.65  0.79
1  B  0.72  0.44  0.53
2  C   0.6  0.89  0.57
3  D  0.54  0.96  0.93
4  E  0.42  0.38  0.07

In [296]:
#df2에서 index열을 제거
df2
df2.reset_index(drop=True)

     C2    C3    C4
0  0.55  0.65  0.79
1  0.72  0.44  0.53
2   0.6  0.89  0.57
3  0.54  0.96  0.93
4  0.42  0.38  0.07

In [304]:
np.random.seed(0)
df3 = pd.DataFrame(np.round(np.random.randn(5, 4), 2),
                  columns=[['A','A','B','B'],
                           ['M','F','M','F']])
df3.columns.names=['Dept', 'Sex']

In [305]:
df3
#0,1번열은 A부서 남,여의 실적
#2,3번열은 B부서 남,여의 실적

Dept     A           B
Sex      M     F     M     F
0     1.76  0.40  0.98  2.24
1     1.87 -0.98  0.95 -0.15
2    -0.10  0.41  0.14  1.45
3     0.76  0.12  0.44  0.33
4     1.49 -0.21  0.31 -0.85

In [306]:
np.random.seed(0)
df4 = pd.DataFrame(np.round(np.random.randn(6, 4), 2),
                   columns=[["A", "A", "B", "B"],
                            ["C", "D", "C", "D"]],
                   index=[["M", "M", "M", "F", "F", "F"],
                          ["id_" + str(i + 1) for i in range(3)] * 2])
df4.columns.names = ["Cidx1", "Cidx2"]
df4.index.names = ["Ridx1", "Ridx2"]
df4

Cidx1           A           B
Cidx2           C     D     C     D
Ridx1 Ridx2
M     id_1   1.76  0.40  0.98  2.24
      id_2   1.87 -0.98  0.95 -0.15
      id_3  -0.10  0.41  0.14  1.45
F     id_1   0.76  0.12  0.44  0.33
      id_2   1.49 -0.21  0.31 -0.85
      id_3  -2.55  0.65  0.86 -0.74

In [307]:
#[1,2,3]*2

[1, 2, 3, 1, 2, 3]

In [308]:
#다중인덱스에서 stack함수 : 열인덱스 -> 행인덱스(열 인덱스가 90도 반시계 방향 회전)
#               unstack함수 :행인덱스 -> 열인덱스(행 인덱스가 90도 시계 방향 회전)

In [309]:
df4

Cidx1           A           B
Cidx2           C     D     C     D
Ridx1 Ridx2
M     id_1   1.76  0.40  0.98  2.24
      id_2   1.87 -0.98  0.95 -0.15
      id_3  -0.10  0.41  0.14  1.45
F     id_1   0.76  0.12  0.44  0.33
      id_2   1.49 -0.21  0.31 -0.85
      id_3  -2.55  0.65  0.86 -0.74

In [314]:
#다중인덱스에서 stack함수 : 열인덱스 -> 행인덱스(열 인덱스가 90도 반시계 방향 회전)
#df4.stack('Cidx2')
df4.stack(0) #0(상위 카테고리) 또는 1(하위 카테고리)

Cidx2                 C     D
Ridx1 Ridx2 Cidx1
M     id_1  A      1.76  0.40
            B      0.98  2.24
      id_2  A      1.87 -0.98
            B      0.95 -0.15
      id_3  A     -0.10  0.41
            B      0.14  1.45
F     id_1  A      0.76  0.12
            B      0.44  0.33
      id_2  A      1.49 -0.21
            B      0.31 -0.85
      id_3  A     -2.55  0.65
            B      0.86 -0.74

In [315]:
df4

Cidx1           A           B
Cidx2           C     D     C     D
Ridx1 Ridx2
M     id_1   1.76  0.40  0.98  2.24
      id_2   1.87 -0.98  0.95 -0.15
      id_3  -0.10  0.41  0.14  1.45
F     id_1   0.76  0.12  0.44  0.33
      id_2   1.49 -0.21  0.31 -0.85
      id_3  -2.55  0.65  0.86 -0.74

In [318]:
df4.unstack("Ridx2")
df4.unstack(1)

Cidx1     A                                   B
Cidx2     C                 D                 C                 D
Ridx2  id_1  id_2  id_3  id_1  id_2  id_3  id_1  id_2  id_3  id_1  id_2  id_3
Ridx1
F      0.76  1.49 -2.55  0.12 -0.21  0.65  0.44  0.31  0.86  0.33 -0.85 -0.74
M      1.76  1.87 -0.10  0.40 -0.98  0.41  0.98  0.95  0.14  2.24 -0.15  1.45

In [319]:
df3

Dept     A           B
Sex      M     F     M     F
0     1.76  0.40  0.98  2.24
1     1.87 -0.98  0.95 -0.15
2    -0.10  0.41  0.14  1.45
3     0.76  0.12  0.44  0.33
4     1.49 -0.21  0.31 -0.85

In [322]:
df3[("B")]

Sex     M     F
0    0.98  2.24
1    0.95 -0.15
2    0.14  1.45
3    0.44  0.33
4    0.31 -0.85

In [323]:
df3[("B","M")]

0    0.98
1    0.95
2    0.14
3    0.44
4    0.31
Name: (B, M), dtype: float64

In [324]:
df3

Dept     A           B
Sex      M     F     M     F
0     1.76  0.40  0.98  2.24
1     1.87 -0.98  0.95 -0.15
2    -0.10  0.41  0.14  1.45
3     0.76  0.12  0.44  0.33
4     1.49 -0.21  0.31 -0.85

In [328]:
df3.loc[0, ("B","M")]
#df3.iloc[0]

0.98

In [329]:
df3.loc[0, ("B","M")]=999

In [330]:
df3

Dept     A             B
Sex      M     F       M     F
0     1.76  0.40  999.00  2.24
1     1.87 -0.98    0.95 -0.15
2    -0.10  0.41    0.14  1.45
3     0.76  0.12    0.44  0.33
4     1.49 -0.21    0.31 -0.85

In [332]:
df3.iloc[0,2]

999.0

In [335]:
df3.loc[(4), ("A", "F")]

-0.21

In [336]:
df4

Cidx1           A           B
Cidx2           C     D     C     D
Ridx1 Ridx2
M     id_1   1.76  0.40  0.98  2.24
      id_2   1.87 -0.98  0.95 -0.15
      id_3  -0.10  0.41  0.14  1.45
F     id_1   0.76  0.12  0.44  0.33
      id_2   1.49 -0.21  0.31 -0.85
      id_3  -2.55  0.65  0.86 -0.74

In [340]:
df4.loc[("M","id_1"), ("A","C")]

1.76

In [341]:
df4.loc[:,("A","C")]

Ridx1  Ridx2
M      id_1     1.76
       id_2     1.87
       id_3    -0.10
F      id_1     0.76
       id_2     1.49
       id_3    -2.55
Name: (A, C), dtype: float64

In [345]:
df4.loc[("M","id_1"), :]

Cidx1  Cidx2
A      C        1.76
       D        0.40
B      C        0.98
       D        2.24
Name: (M, id_1), dtype: float64

In [346]:
df4

Cidx1           A           B
Cidx2           C     D     C     D
Ridx1 Ridx2
M     id_1   1.76  0.40  0.98  2.24
      id_2   1.87 -0.98  0.95 -0.15
      id_3  -0.10  0.41  0.14  1.45
F     id_1   0.76  0.12  0.44  0.33
      id_2   1.49 -0.21  0.31 -0.85
      id_3  -2.55  0.65  0.86 -0.74

In [355]:
np.random.seed(0)
df4 = pd.DataFrame(np.round(np.random.randn(6, 4), 2),
                   columns=[["A", "A", "B", "B"],
                            ["C", "D", "C", "D"]],
                   index=[["M", "M", "M", "F", "F", "F"],
                          ["id_" + str(i + 1) for i in range(3)] * 2])
df4.columns.names = ["Cidx1", "Cidx2"]
df4.index.names = ["Ridx1", "Ridx2"]
df4

Cidx1           A           B
Cidx2           C     D     C     D
Ridx1 Ridx2
M     id_1   1.76  0.40  0.98  2.24
      id_2   1.87 -0.98  0.95 -0.15
      id_3  -0.10  0.41  0.14  1.45
F     id_1   0.76  0.12  0.44  0.33
      id_2   1.49 -0.21  0.31 -0.85
      id_3  -2.55  0.65  0.86 -0.74

In [356]:
df4.sum() #df4.sum(axis=0)
#df4.sum(axis=1)
df4.loc[("Tot", "Tot"),:]=df4.sum()

In [357]:
df4

Cidx1           A           B
Cidx2           C     D     C     D
Ridx1 Ridx2
M     id_1   1.76  0.40  0.98  2.24
      id_2   1.87 -0.98  0.95 -0.15
      id_3  -0.10  0.41  0.14  1.45
F     id_1   0.76  0.12  0.44  0.33
      id_2   1.49 -0.21  0.31 -0.85
      id_3  -2.55  0.65  0.86 -0.74
Tot   Tot    3.23  0.39  3.68  2.28

In [358]:
#Ridx1와 Ridx2 순서 변경
df5=df4.swaplevel("Ridx1","Ridx2") #df4.swaplevel("Ridx1","Ridx2",0) 0이면 행, 1이면 열
df5

Cidx1           A           B
Cidx2           C     D     C     D
Ridx2 Ridx1
id_1  M      1.76  0.40  0.98  2.24
id_2  M      1.87 -0.98  0.95 -0.15
id_3  M     -0.10  0.41  0.14  1.45
id_1  F      0.76  0.12  0.44  0.33
id_2  F      1.49 -0.21  0.31 -0.85
id_3  F     -2.55  0.65  0.86 -0.74
Tot   Tot    3.23  0.39  3.68  2.28

In [359]:
df6=df4.swaplevel("Cidx1","Cidx2",1) 
df6

Cidx2           C     D     C     D
Cidx1           A     A     B     B
Ridx1 Ridx2
M     id_1   1.76  0.40  0.98  2.24
      id_2   1.87 -0.98  0.95 -0.15
      id_3  -0.10  0.41  0.14  1.45
F     id_1   0.76  0.12  0.44  0.33
      id_2   1.49 -0.21  0.31 -0.85
      id_3  -2.55  0.65  0.86 -0.74
Tot   Tot    3.23  0.39  3.68  2.28

In [362]:
df5

Cidx1           A           B
Cidx2           C     D     C     D
Ridx2 Ridx1
id_1  M      1.76  0.40  0.98  2.24
id_2  M      1.87 -0.98  0.95 -0.15
id_3  M     -0.10  0.41  0.14  1.45
id_1  F      0.76  0.12  0.44  0.33
id_2  F      1.49 -0.21  0.31 -0.85
id_3  F     -2.55  0.65  0.86 -0.74
Tot   Tot    3.23  0.39  3.68  2.28

In [364]:
df5.sort_index(level=1)

Cidx1           A           B
Cidx2           C     D     C     D
Ridx2 Ridx1
id_1  F      0.76  0.12  0.44  0.33
id_2  F      1.49 -0.21  0.31 -0.85
id_3  F     -2.55  0.65  0.86 -0.74
id_1  M      1.76  0.40  0.98  2.24
id_2  M      1.87 -0.98  0.95 -0.15
id_3  M     -0.10  0.41  0.14  1.45
Tot   Tot    3.23  0.39  3.68  2.28

# 과제

1. 모든 행과 열에 라벨을 가지는 5 x 5 이상의 크기를 가지는 데이터프레임을 만든다.  
   최대한 다양한 방법으로 특정한 행과 열을 선택한다.

In [16]:
import pandas as pd
import numpy as np

df1=pd.DataFrame(np.array(range(1,26)).reshape(5,5),
             index=['a','b','c','d','e'],
             columns=['가','나','다','라','마'])

df1.loc['a','가':'라']
df1.iloc[0:3,2:4]
df1['가']
df1.가
df1['a':'c']
df1[0:2]

2. 타이타닉호 승객 데이터의 데이터 개수를 각 열마다 구해본다.
    결측값의 개수를 파악해본다

t=sns.load_dataset("titanic")
t.head()

t.info()
t.count()

na_num=[]
for i in range(len(t.columns)):
    na_num.append(sum(t.iloc[:,i].isna()))
na_num    

3. sort_values 메서드를 사용하여 타이타닉호 승객에 대해 
성별(sex) 인원수, 나이별(age) 인원수, 선실별(class) 인원수, 사망/생존(alive) 인원수를 구하라.

t.columns

features=['sex', 'age','pclass','survived']
for i in features:
    print(t[i].value_counts())


4.
타이타닉호 승객의 평균 나이를 구하라.
타이타닉호 승객중 여성 승객의 평균 나이를 구하라.
타이타닉호 승객중 1등실 선실의 여성 승객의 평균 나이를 구하라.

print(t.age.mean())
print(t.loc[t.sex=='female','age'].mean())
print(t.groupby('pclass').age.mean()[1])

5. 타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category1 열을 만들어라. category1 카테고리는 다음과 같이 정의된다.  
20살이 넘으면 성별을 그대로 사용한다.  
20살 미만이면 성별에 관계없이 “child”라고 한다.

t['category1']=t.apply(lambda x: 'adult' if x.age>20 else 'child',axis=1)

t.category1[t['category1']=='adult']= [i for i in t.sex[t['category1']=='adult']]

t['category1']

6.  
타이타닉호의 승객 중 나이를 명시하지 않은 고객은 나이를 명시한 고객의 평균 나이 값이   되도록 titanic 데이터프레임을 고쳐라.  

t.age[t.age.isna()]=t.age.mean()

7. 타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category2 열을 만들어라. category2 카테고리는 다음과 같이 정의된다.  
성별을 나타내는 문자열 male 또는 female로 시작한다.  
성별을 나타내는 문자열 뒤에 나이를 나타내는 문자열이 온다.  
예를 들어 27살 남성은 male27 값이 된다.  


t['category2']=[t.sex.iloc[i]+str(int(t.age.iloc[i])) for i in range(len(t))]

8.타이타닉호 승객을 ‘미성년자’, ‘청년’, ‘중년’, ‘장년’, ‘노년’ 나이 그룹으로 나눈다.  

bins = [1, 20, 30, 50, 70, 100]  
labels = ["미성년자", "청년", "중년", "장년", "노년"]  
그리고 각 나이 그룹의 승객 비율을 구한다. 비율의 전체 합은 1이 되어야 한다.  

bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]  
t['agecat']=pd.cut(t.age,bins,labels=labels)

(t['agecat'].value_counts()/len(t))
(t['agecat'].value_counts()/len(t)).sum()

9. 타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category3 열을 만들어라. category3 카테고리는 다음과 같이 정의된다.
20살 미만이면 성별에 관계없이 “미성년자”라고 한다.  
20살 이상이면 나이에 따라 “청년”, “중년”, “장년”, “노년”을 구분하고 그 뒤에   성별을 나타내는 “남성”, “여성”을 붙인다.  

t['category3']=np.where(t.age <20,'미성년자','성인')

t['category3'][t['category3']=='성인']=[i for i in t.agecat[t['category3']=='성인']]

10. (다중인덱스)  
A 반 학생 5명과 B반 학생 5명의 국어, 영어, 수학 점수를 나타내는 데이터프레임을 다음과 같이 만든다.  
“반”, “번호”, “국어”, “영어”, “수학” 을 열로 가지는 데이터프레임 df_score3을 만든다.  
df_score3을 변형하여 1차 행 인덱스로 “반”을 2차 행 인덱스로 “번호”을 가지는 데이터프레임 df_score4을 만든다.  
데이터 프레임 df_score4에 각 학생의 평균을 나타내는 행을 오른쪽에 추가한다.  
df_score3을 변형하여 행 인덱스로 “번호”를, 1차 열 인덱스로 “국어”, “영어”, “수학”을,   
2차 열 인덱스로 “반”을 가지는 데이터프레임 df_score5을 만든다.  
데이터 프레임 df_score5에 각 반별 각 과목의 평균을 나타내는 행을 아래에 추가한다.  


df_score3=pd.DataFrame({'반':['A','B','A','B','B'],
                        '번호':[1,1,2,3,4],
                        '국어':[50,40,60,70,50],
                        '영어':[100,80,50,70,30],
                        '수학':[50,60,70,20,90]})

df_score4=df_score3.set_index(['반','번호'])

df_score4['총합']=df_score4.apply(sum,axis=1)

df_score4['평균']=df_score4['총합']/len(df_score4)

df_score5=df_score4.unstack(1)

df_score5